print("%d" % 123)

print("100")
print("%d" % 100)
print("100 + 100")
print("%d" % (100 + 100))
print("%d %d" % (100, 200))
print("%d" % (100))


print("%d/ %d = %d" % (100, 200, 0.5))
print("%d/ %d = %5.1f" % (100, 200, 0.5))

print("%d" % 123)
print("%5d" % 123)
print("%05d" % 123)
## 5d는 전체 5칸 확보후 우측 정렬 05d는 전체 5칸 확보후 우측 정렬, 빈칸은 0으로##
print("%f" % 123.45)
print("%7.1f" % 123.45)
print("%7.3f" % 123.45)
## 7.1f는 전체 7칸 확보후 소수점 1자리까지 7.3f는 전체 7칸 확보후 소수점 3자리까지##
print("%s" % "Python")
print("%10s" % "Python")
## 10s는 전체 10칸 확보후 우측 정렬 ##

print("한 행입니다. \n 또 한 행입니다.")

for i in range(1, 6):
    print(" "*(5-i), "*"*(2*i-1))
for i in range(4,0,-1):
    print(" "*(5-i), "*"*(2*i-1))